[{"uid":"7fc0c6e71339a0e7","name":"Verify \"Number pricing\" text changes when switching \"Pay as you go\" dropdown to \"Canada\" on \"Numbers pricing\" page","time":{"start":1686040365012,"stop":1686040395114,"duration":30102},"status":"passed","severity":"normal"},{"uid":"3c9201e7f4e9b3d6","name":"Verify that \"Thank you for submitting your abuse complaint.\" message appears and user is not signed in after submitting Sign up form empty fields, the \"Sign up\" form is triggered after clicking the \"portal\" button on the \"SMS API\" page.","time":{"start":1686040802573,"stop":1686040813215,"duration":10642},"status":"passed","severity":"normal"},{"uid":"c138bce2221d0a16","name":"Verify \"Number pricing\" text changes when switching \"Pay as you go\" dropdown to \"Ukraine\" on \"Numbers pricing\" page","time":{"start":1686040395717,"stop":1686040407550,"duration":11833},"status":"passed","severity":"normal"},{"uid":"995035a8d58c8e6c","name":"Verify that after clicking on the \"See pricing\" button from the Global Numbers page the \"Pay as you go\" and \"Volume-based pricing\" windows appears.","time":{"start":1686040506566,"stop":1686040515159,"duration":8593},"status":"passed","severity":"normal"},{"uid":"dfafd6e5805b2fb1","name":"Verify that after clicking on the \"Telnyxs Terms & Conditions\" button from the Sign up page the \"Telnyxs Terms & Conditions\" text appears.","time":{"start":1686040675879,"stop":1686040679591,"duration":3712},"status":"failed","severity":"normal"},{"uid":"88e25f9002bc085","name":"Verify that \"The last one step\" message appears after submitting Sign up form with valid credentials, the Sign up form is triggered after clicking the \"Search Numbers\" button on the \"Global Numbers\" page.","time":{"start":1686040431125,"stop":1686040449567,"duration":18442},"status":"passed","severity":"normal"},{"uid":"10337e161b61810a","name":"Verify that \"Mission Control Portal\" topic text visibility on \"Mission Control\" page","time":{"start":1686040613248,"stop":1686040621210,"duration":7962},"status":"passed","severity":"normal"},{"uid":"68bbe627f0185fd3","name":"Verify that \"Mission Control Portal\" \"industry-leading platform\" link-button visibility on \"Mission Control\" page","time":{"start":1686040621493,"stop":1686040628391,"duration":6898},"status":"passed","severity":"normal"},{"uid":"974b9689097f21c5","name":"Verify that after clicking on the \"Privacy Policy\" button from the Sign up page the \"Privacy Policy\" text appears.","time":{"start":1686040690870,"stop":1686040699457,"duration":8587},"status":"passed","severity":"normal"},{"uid":"c45b0b546f7a7303","name":"Verify \"See industries\" button scroll to \"Healthcare\" button on the \"Solutions\" page","time":{"start":1686040555010,"stop":1686040561668,"duration":6658},"status":"passed","severity":"normal"},{"uid":"7935c888db0c4b19","name":"Verify that \"This field is required.\" message appears after clicking \"Submit\" button with empty fields, the \"Become a Telnyx Partner\" form is triggered after clicking the \"Become a partner\" button on the \"Partnerships\" page.","time":{"start":1686040710812,"stop":1686040721922,"duration":11110},"status":"passed","severity":"normal"},{"uid":"c8ebf993e37649f4","name":"Verify that \"Thank you.\" message appears after submitting Contact Us form with valid credentials, the \"Contact Us\" form is triggered after clicking the \"Talk to an expert\" link button on the \"g2-compare\" page.","time":{"start":1686040641200,"stop":1686040662423,"duration":21223},"status":"passed","severity":"normal"},{"uid":"1301a231dfae6313","name":"Verify that \"That email and password combinations is not valid ...\" message appears and user is not signed in after submitting Log In form with invalid credentials from Contuct Us page","time":{"start":1686040844723,"stop":1686040862315,"duration":17592},"status":"passed","severity":"normal"},{"uid":"6e2e1932d7e0e34e","name":"Verify that \"Thank you.\" message appears after submitting Contact Us form with valid credentials, the \"Contact Us\" form is triggered after clicking the \"Ask our experts\" button on the \"Global Numbers\" page.","time":{"start":1686040471648,"stop":1686040492232,"duration":20584},"status":"passed","severity":"normal"},{"uid":"869a40adbe565ce0","name":"Verify \"See use cases\" button scroll to \"Account notifications\" text and image on the \"Solutions\" page","time":{"start":1686040561789,"stop":1686040567663,"duration":5874},"status":"passed","severity":"normal"},{"uid":"e32da4bc9fb8d08d","name":"Verify that \"The last one step\" message appears and \"Confirm email\" page is loading after clicking \"Submit\" button,  the Sign up form is triggered after clicking the \"portal\" link button on the \"SMS API\" page.","time":{"start":1686040583183,"stop":1686040600840,"duration":17657},"status":"passed","severity":"normal"},{"uid":"17285e0abd988598","name":"Verify that \"Thank you.\" message appears after submitting \"Become a Telnyx Partner\" form with valid credentials, the \"Become a Telnyx Partner\" form is triggered after clicking the \"Become a partner\" button on the \"Partnerships\" page.","time":{"start":1686040527013,"stop":1686040544011,"duration":16998},"status":"passed","severity":"normal"},{"uid":"bdcf4d1953fdcacb","name":"Verify that \"Required\" message appears and user is not signed in after submitting Sign In form with invalid credentials, the \"Sign In\" form is triggered after clicking the \"Log In\" link button on the \"Sign Up\" page.","time":{"start":1686041025678,"stop":1686041037062,"duration":11384},"status":"passed","severity":"normal"}]